Revit 2027 API
ParameterTypeId.WallSweepOrientation Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallSweepOrientation { get; }
Public Shared ReadOnly Property WallSweepOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallSweepOrientation {
	ForgeTypeId^ get ();
}
static member WallSweepOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace